{
  "navbar": {
    "about": "About",
    "projects": "Projects",
    "education": "Education",
    "skills": "Skills",
    "interests": "Interests"
  },
  "aboutPage": {
    "introduction": {
      "greetings": "Hi, I'm",
      "name": "Wellington Carlos Massola",
      "personalTitle": "Front and Back-End Developer"
    },
    "mainText": {
      "part1": "I have a bachelor degree in Computer Science at the university UNESP in Bauru. My completion of course work was about the use of non-linear programming to the dimentions of an Indian Biodigester (Develeoped using Java).",
      "part2": "The last few years I worked with logistics, but I am currently looking for a jog as a developer (Java / Javascript / C) and I am currently working on personal and frellance projects.",
      "part3": "I am currently studying AWS Lambda and S3 and I am mainly interested in focussing on back-end development."
    }
  },
  "projectsPage": {
    "droneDelivery": {
      "title": "Drone Delivery",
      "description": {
        "part1": "Android game developed with the engine Godot 3.2. That's the first game that I developed with this engine, so it's a simple game.",
        "part2": "To make the game more interesting, I implemented a flock simulation algorithm (Boids) based on the originally developed by Craig Reynolds in 1989."
      }
    },
    "boidsReactP5": {
      "title": "Boids Com React e P5",
      "description": {
        "part1": "I reused my boids implementations from the game Drone Delivery to try the skektchs library p5.js with React.",
        "part2": "The objective of this test was to verify the viability of using p5.js to make visualizations of algorithms and simulations with React."
      }
    },
    "abyssalDive": {
      "title": "Abyssal Dive",
      "description": {
        "part1": "Android game developed with Java on Android Studio using the framework libGDX.",
        "part2": "The game consists of controlling a sbumarine and dodge obstacles while getting batteries. The game gets darker as the players go down and the batteries become more and more important to see the obstacles."
      }
    },
    "kawaiiChat": {
      "title": "KawaiiChat",
      "description": {
        "part1": "Android app where people that like japanese animations can find others with similar taste that live close to talk, answer quizzes, personalize the profile and send presents.",
        "part2": "It was developed in Java using Android Studio to develop most of the Front End and it was mainly used Firebase Firestore and Firebase Cloud Functions for the BackEnd.",
        "part3": "The Cloud Functions were developed in Typecript (Node.js), to find users based on location were utilized GeoHashs, the user images were stored on Firebase Cloud Storage and for ads AdMob was utilized."
      }
    },
    "investmentBlog": {
      "title": "InvestmentBlog (in development)",
      "description": {
        "part1": "In development (using MERN stack and Docker)"
      }
    },
    "githubPages": {
      "title": "well1ngton.github.io (portfolio)",
      "description": {
        "part1": "This website was developed with React, Typescript, Bootstrap and i18next for multilanguage support.",
        "part2": "You can find the GitHub link on the botton part of this card."
      }
    }
  }
}
